; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 177168 1 3 3 3 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	image0 - mode
	infrared2 - mode
	image1 - mode
	GroundStation1 - direction
	GroundStation0 - direction
	Star2 - direction
	Star3 - direction
	Star4 - direction
	Planet5 - direction
	Star6 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 image0)
	(supports instrument1 infrared2)
	(supports instrument1 image1)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
)
(:goal (and
	(pointing satellite0 Star2)
	(have_image Star3 image0)
	(have_image Star4 image0)
	(have_image Planet5 infrared2)
	(have_image Star6 image1)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 5
2. (turn_to satellite0 star2 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star2)
   goals met: 1 of 5
3. (calibrate satellite0 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 1 of 5
4. (turn_to satellite0 star6 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star6)
   goals met: 0 of 5
5. (take_image satellite0 star6 instrument1 image1)
   added: (have_image star6 image1)
   goals met: 1 of 5
6. (turn_to satellite0 star3 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star3)
   goals met: 1 of 5
7. (take_image satellite0 star3 instrument1 image0)
   added: (have_image star3 image0)
   goals met: 2 of 5
8. (turn_to satellite0 star2 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star2)
   goals met: 3 of 5
9. (turn_to satellite0 planet5 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet5)
   goals met: 2 of 5
10. (take_image satellite0 planet5 instrument1 infrared2)
   added: (have_image planet5 infrared2)
   goals met: 3 of 5
11. (turn_to satellite0 star2 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 star2)
   goals met: 4 of 5
12. (turn_to satellite0 star4 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star4)
   goals met: 3 of 5
13. (take_image satellite0 star4 instrument1 image0)
   added: (have_image star4 image0)
   goals met: 4 of 5
14. (turn_to satellite0 star2 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star2)
   goals met: 5 of 5
